app/controllers/draw_controller.rb

SELECT COUNT(*) FROM "cleaning_entries"
---
  def set_users_draw_info_get
    @users_draw_info = CleaningEntry.select("id, name, draw_no, join_flag, pass, join_count, hit_count")