app/controllers/draw_controller.rb

SELECT "cleaning_entries".* FROM "cleaning_entries"
---
  def user_index
    @entry = CleaningEntry.all

SELECT  "cleaning_entries".* FROM "cleaning_entries"  WHERE "cleaning_entries"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "cleaning_entries" SET "join_flag" = ?, "updated_at" = ? WHERE "cleaning_entries"."id" = 1  [["join_flag", 1], ["updated_at", "2015-06-16 07:07:21.308493"]]
---
  def user_result
    entry = CleaningEntry.find(session[:id])
    entry.join_flag = 1
    entry.save

SELECT  "cleaning_entries".* FROM "cleaning_entries"  WHERE "cleaning_entries"."id" = ? LIMIT 1  [["id", 1]]
---
  def user_show
    @entry = CleaningEntry.find(params[:entry][:id])